ErisdarDemo/Bluetooth-Characteristic/Client/Code/nRF52832/main.c
/*************************************************************************************************/
/** @file	main.c
 *  @brief	BLE LED Button Service central and client application main file.
 *  @details	Source code for a sample client application using the LED Button service.
 *
 *  @author	Justin Reina, Firmware Engineer
 *  @source     examples\ble_central\ble_app_blinky_c
 *  @created	12/16/22
 *  @last rev	12/16/22
 *
 *
 *  @notes	x
 *
 *  @section	Opens
 *      none current
 *
 *  @section	Legal Disclaimer
 *      © 2022 Justin Reina, All rights reserved. All contents of this source file and/or 
 *      any other related source  files are the explicit property of Justin Reina. 
 *      Do not distribute. Do not copy.
 */
/*************************************************************************************************/

//Standard Library Includes
#include <stdint.h>
#include <stdio.h>
#include <string.h>

//Toolchain Includes
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"
#include "nrf_pwr_mgmt.h"
#include "app_timer.h"
#include "boards.h"
#include "bsp.h"
#include "bsp_btn_ble.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "ble_db_discovery.h"
#include "ble_lbs_c.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_scan.h"

//Logging Includes
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

//Definitions
#define CENTRAL_SCANNING_LED            BSP_BOARD_LED_0                     /* Scanning LED will be on when the device is scanning                                                    */
#define CENTRAL_CONNECTED_LED           BSP_BOARD_LED_1                     /* Connected LED will be on when the device is connected                                                  */
#define LEDBUTTON_LED                   BSP_BOARD_LED_2                     /* LED to indicate a change of state of the the Button characteristic on the peer                         */

#define SCAN_INTERVAL                   0x00A0                              /* Determines scan interval in units of 0.625 millisecond                                                 */
#define SCAN_WINDOW                     0x0050                              /* Determines scan window in units of 0.625 millisecond                                                   */
#define SCAN_DURATION                   0x0000                              /* Timout when scanning. 0x0000 disables timeout                                                          */

#define MIN_CONNECTION_INTERVAL         MSEC_TO_UNITS(7.5, UNIT_1_25_MS)    /* Determines minimum connection interval in milliseconds                                                 */
#define MAX_CONNECTION_INTERVAL         MSEC_TO_UNITS(30, UNIT_1_25_MS)     /* Determines maximum connection interval in milliseconds                                                 */
#define SLAVE_LATENCY                   0                                   /* Determines slave latency in terms of connection events                                                 */
#define SUPERVISION_TIMEOUT             MSEC_TO_UNITS(4000, UNIT_10_MS)     /* Determines supervision time-out in units of 10 milliseconds                                            */

#define LEDBUTTON_BUTTON_PIN            BSP_BUTTON_0                        /* Button that will write to the LED characteristic of the peer                                           */
#define BUTTON_DETECTION_DELAY          APP_TIMER_TICKS(50)                 /* Delay from a GPIOTE event until a button is reported as pushed (in number of timer ticks)              */

#define APP_BLE_CONN_CFG_TAG            1                                   /* A tag identifying the SoftDevice BLE configuration                                                     */
#define APP_BLE_OBSERVER_PRIO           3                                   /* Application's BLE observer priority. You shouldn't need to modify this value                           */

NRF_BLE_SCAN_DEF(m_scan);                                                   /* Scanning module instance                                                                               */
BLE_LBS_C_DEF(m_ble_lbs_c);                                                 /* Main structure used by the LBS client module                                                           */
NRF_BLE_GATT_DEF(m_gatt);                                                   /* GATT module instance                                                                                   */
BLE_DB_DISCOVERY_DEF(m_db_disc);                                            /* DB discovery module instance                                                                           */
NRF_BLE_GQ_DEF(m_ble_gatt_queue,                                            /* BLE GATT Queue instance                                                                                */
               NRF_SDH_BLE_CENTRAL_LINK_COUNT,
               NRF_BLE_GQ_QUEUE_SIZE);

//Local Constants
static char const m_target_periph_name[] = "Nordic_Blinky";                 /* Name of the device we try to connect to. This name is searched in the scan report data                 */


/*************************************************************************************************/
/** @fcn	void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
 *  @brief	x
 *  @details	x
 *
 *  @section	Purpose
 *      x
 *
 *  @param	[in]	name	descrip
 *
 *  @param	[out]	name	descrip
 *
 *  @return	(type) descrip
 *
 *  @pre	x
 *
 *  @post	x
 *
 *  @section	Operation
 *	x
 *		
 *  @section	Opens
 *  	x
 *
 *  @section	Hazards & Risks
 *  	x
 *
 *  @section	Todo
 *	x
 *
 *  @section	Timing
 *  	x
 *
 *  @note     x
 */
/*************************************************************************************************/
/**@brief Function to handle asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num     Line number of the failing ASSERT call.
 * @param[in] p_file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name) {

    app_error_handler(0xDEADBEEF, line_num, p_file_name);

    return;
}


/*************************************************************************************************/
/** @fcn	static void lbs_error_handler(uint32_t nrf_error)
 *  @brief	x
 *  @details	x
 *
 *  @section	Purpose
 *      x
 *
 *  @param	[in]	name	descrip
 *
 *  @param	[out]	name	descrip
 *
 *  @return	(type) descrip
 *
 *  @pre	x
 *
 *  @post	x
 *
 *  @section	Operation
 *	x
 *		
 *  @section	Opens
 *  	x
 *
 *  @section	Hazards & Risks
 *  	x
 *
 *  @section	Todo
 *	x
 *
 *  @section	Timing
 *  	x
 *
 *  @note     x
 */
/*************************************************************************************************/
/**@brief Function for handling the LED Button Service client errors.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void lbs_error_handler(uint32_t nrf_error) {

    APP_ERROR_HANDLER(nrf_error);

    return;
}


/*************************************************************************************************/
/** @fcn	static void leds_init(void)
 *  @brief	x
 *  @details	x
 *
 *  @section	Purpose
 *      x
 *
 *  @param	[in]	name	descrip
 *
 *  @param	[out]	name	descrip
 *
 *  @return	(type) descrip
 *
 *  @pre	x
 *
 *  @post	x
 *
 *  @section	Operation
 *	x
 *		
 *  @section	Opens
 *  	x
 *
 *  @section	Hazards & Risks
 *  	x
 *
 *  @section	Todo
 *	x
 *
 *  @section	Timing
 *  	x
 *
 *  @note     x
 */
/*************************************************************************************************/
/**@brief Function for the LEDs initialization.
 *
 * @details Initializes all LEDs used by the application.
 */
static void leds_init(void) {

    bsp_board_init(BSP_INIT_LEDS);

    return;
}


/*************************************************************************************************/
/** @fcn	static void scan_start(void)
 *  @brief	x
 *  @details	x
 *
 *  @section	Purpose
 *      x
 *
 *  @param	[in]	name	descrip
 *
 *  @param	[out]	name	descrip
 *
 *  @return	(type) descrip
 *
 *  @pre	x
 *
 *  @post	x
 *
 *  @section	Operation
 *	x
 *		
 *  @section	Opens
 *  	x
 *
 *  @section	Hazards & Risks
 *  	x
 *
 *  @section	Todo
 *	x
 *
 *  @section	Timing
 *  	x
 *
 *  @note     x
 */
/*************************************************************************************************/
/**@brief Function to start scanning.
 */
static void scan_start(void) {

    ret_code_t err_code;

    err_code = nrf_ble_scan_start(&m_scan);
    APP_ERROR_CHECK(err_code);

    bsp_board_led_off(CENTRAL_CONNECTED_LED);
    bsp_board_led_on(CENTRAL_SCANNING_LED);

    return;
}


/*************************************************************************************************/
/** @fcn	static void lbs_c_evt_handler(ble_lbs_c_t * p_lbs_c, ble_lbs_c_evt_t * p_lbs_c_evt)
 *  @brief	x
 *  @details	x
 *
 *  @section	Purpose
 *      x
 *
 *  @param	[in]	name	descrip
 *
 *  @param	[out]	name	descrip
 *
 *  @return	(type) descrip
 *
 *  @pre	x
 *
 *  @post	x
 *
 *  @section	Operation
 *	x
 *		
 *  @section	Opens
 *  	x
 *
 *  @section	Hazards & Risks
 *  	x
 *
 *  @section	Todo
 *	x
 *
 *  @section	Timing
 *  	x
 *
 *  @note     x
 */
/*************************************************************************************************/
/**@brief Handles events coming from the LED Button central module.
 */
static void lbs_c_evt_handler(ble_lbs_c_t * p_lbs_c, ble_lbs_c_evt_t * p_lbs_c_evt) {

    switch (p_lbs_c_evt->evt_type)
    {
        case BLE_LBS_C_EVT_DISCOVERY_COMPLETE:
        {
            ret_code_t err_code;

            err_code = ble_lbs_c_handles_assign(&m_ble_lbs_c,
                                                p_lbs_c_evt->conn_handle,
                                                &p_lbs_c_evt->params.peer_db);
            NRF_LOG_INFO("LED Button service discovered on conn_handle 0x%x.", p_lbs_c_evt->conn_handle);

