ErisdarDemo/Bluetooth-Characteristic/Client/Code/nRF52832/main.c
    switch (pin_no)
    {
        case LEDBUTTON_BUTTON_PIN:
            err_code = ble_lbs_led_status_send(&m_ble_lbs_c, button_action);
            if (err_code != NRF_SUCCESS &&
                err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            if (err_code == NRF_SUCCESS)
            {
                NRF_LOG_INFO("LBS write LED state %d", button_action);
            }
            break;

        default:
            APP_ERROR_HANDLER(pin_no);
            break;
    }

    return;
}


/*************************************************************************************************/
/** @fcn	static void scan_evt_handler(scan_evt_t const * p_scan_evt)
 *  @brief	x
 *  @details	x
 *
 *  @section	Purpose
 *      x
 *
 *  @param	[in]	name	descrip
 *
 *  @param	[out]	name	descrip
 *
 *  @return	(type) descrip
 *
 *  @pre	x
 *
 *  @post	x
 *
 *  @section	Operation
 *	x
 *		
 *  @section	Opens
 *  	x
 *
 *  @section	Hazards & Risks
 *  	x
 *
 *  @section	Todo
 *	x
 *
 *  @section	Timing
 *  	x
 *
 *  @note     x
 */
/*************************************************************************************************/
/**@brief Function for handling Scaning events.
 *
 * @param[in]   p_scan_evt   Scanning event.
 */
static void scan_evt_handler(scan_evt_t const * p_scan_evt) {

    ret_code_t err_code;

    switch(p_scan_evt->scan_evt_id)
    {
        case NRF_BLE_SCAN_EVT_CONNECTING_ERROR:
            err_code = p_scan_evt->params.connecting_err.err_code;
            APP_ERROR_CHECK(err_code);
            break;
        default:
          break;
    }

    return;
}


/*************************************************************************************************/
/** @fcn	static void buttons_init(void)
 *  @brief	function for initializing the button handler modul
 *  @details	x
 */
/*************************************************************************************************/
static void buttons_init(void) {

    ret_code_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {LEDBUTTON_BUTTON_PIN, false, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, ARRAY_SIZE(buttons),
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);

    return;
}


/*************************************************************************************************/
/** @fcn	static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
 *  @brief	x
 *  @details	x
 *
 *  @section	Purpose
 *      x
 *
 *  @param	[in]	name	descrip
 *
 *  @param	[out]	name	descrip
 *
 *  @return	(type) descrip
 *
 *  @pre	x
 *
 *  @post	x
 *
 *  @section	Operation
 *	x
 *		
 *  @section	Opens
 *  	x
 *
 *  @section	Hazards & Risks
 *  	x
 *
 *  @section	Todo
 *	x
 *
 *  @section	Timing
 *  	x
 *
 *  @note     x
 */
/*************************************************************************************************/
/**@brief Function for handling database discovery events.
 *
 * @details This function is callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function should forward the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t * p_evt) {

    ble_lbs_on_db_disc_evt(&m_ble_lbs_c, p_evt);

    return;
}


/*************************************************************************************************/
/** @fcn	static void db_discovery_init(void)
 *  @brief	x
 *  @details	x
 *
 *  @section	Purpose
 *      x
 *
 *  @param	[in]	name	descrip
 *
 *  @param	[out]	name	descrip
 *
 *  @return	(type) descrip
 *
 *  @pre	x
 *
 *  @post	x
 *
 *  @section	Operation
 *	x
 *		
 *  @section	Opens
 *  	x
 *
 *  @section	Hazards & Risks
 *  	x
 *
 *  @section	Todo
 *	x
 *
 *  @section	Timing
 *  	x
 *
 *  @note     x
 */
/*************************************************************************************************/
/**@brief Database discovery initialization.
 */
static void db_discovery_init(void) {

    ble_db_discovery_init_t db_init;

    memset(&db_init, 0, sizeof(db_init));

    db_init.evt_handler  = db_disc_handler;
    db_init.p_gatt_queue = &m_ble_gatt_queue;

    ret_code_t err_code = ble_db_discovery_init(&db_init);
    APP_ERROR_CHECK(err_code);

    return;
}


/*************************************************************************************************/
/** @fcn	static void log_init(void)
 *  @brief	x
 *  @details	x
 *
 *  @section	Purpose
 *      x
 *
 *  @param	[in]	name	descrip
 *
 *  @param	[out]	name	descrip
 *
 *  @return	(type) descrip
 *
 *  @pre	x
 *
 *  @post	x
 *
 *  @section	Operation
 *	x
 *		
 *  @section	Opens
 *  	x
 *
 *  @section	Hazards & Risks
 *  	x
 *
 *  @section	Todo
 *	x
 *
 *  @section	Timing
 *  	x
 *
 *  @note     x
 */
/*************************************************************************************************/
/**@brief Function for initializing the log.
 */
static void log_init(void) {

    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();

    return;
}


/*************************************************************************************************/
/** @fcn	static void timer_init(void)
 *  @brief	function for initializing the timer
 *  @details	x
 */
/*************************************************************************************************/
static void timer_init(void) {

    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    return;
}


/*************************************************************************************************/
/** @fcn	static void power_management_init(void)
 *  @brief	function for initializing the Power manager
 *  @details	x
 */
/*************************************************************************************************/
static void power_management_init(void) {

    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);

    return;
}


/*************************************************************************************************/
/** @fcn	static void scan_init(void)
 *  @brief	x
 *  @details	x
 *
 *  @section	Purpose
 *      x
 *
 *  @param	[in]	name	descrip
 *
 *  @param	[out]	name	descrip
 *
 *  @return	(type) descrip
 *
 *  @pre	x
 *
 *  @post	x
 *
 *  @section	Operation
 *	x
 *		
 *  @section	Opens
 *  	x
 *
 *  @section	Hazards & Risks
 *  	x
 *
 *  @section	Todo
 *	x
 *
 *  @section	Timing
 *  	x
 *
 *  @note     x
 */
/*************************************************************************************************/
static void scan_init(void) {

    ret_code_t          err_code;
    nrf_ble_scan_init_t init_scan;

