ErisdarDemo/Bluetooth-Characteristic/Client/Code/nRF52832/main.c
    memset(&init_scan, 0, sizeof(init_scan));

    init_scan.connect_if_match = true;
    init_scan.conn_cfg_tag     = APP_BLE_CONN_CFG_TAG;

    err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
    APP_ERROR_CHECK(err_code);

    // Setting filters for scanning.
    err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_NAME_FILTER, false);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_NAME_FILTER, m_target_periph_name);
    APP_ERROR_CHECK(err_code);

    return;
}


/*************************************************************************************************/
/** @fcn	static void gatt_init(void)
 *  @brief	function for initializing the GATT module
 *  @details	x
 */
/*************************************************************************************************/
static void gatt_init(void) {

    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);

    return;
}


/*************************************************************************************************/
/** @fcn	static void idle_state_handle(void)
 *  @brief	function for handling the idle state (main loop)
 *  @details	handle any pending log operation(s), then sleep until the next event occurs
 *
 *  @section	Purpose
 *      x
 *
 *  @param	[in]	name	descrip
 *
 *  @param	[out]	name	descrip
 *
 *  @return	(type) descrip
 *
 *  @pre	x
 *
 *  @post	x
 *
 *  @section	Operation
 *	x
 *		
 *  @section	Opens
 *  	x
 *
 *  @section	Hazards & Risks
 *  	x
 *
 *  @section	Todo
 *	x
 *
 *  @section	Timing
 *  	x
 *
 *  @note     x
 */
/*************************************************************************************************/
static void idle_state_handle(void) {

    NRF_LOG_FLUSH();
    nrf_pwr_mgmt_run();

    return;
}


/*************************************************************************************************/
/** @fcn	int main(void)
 *  @brief	function for application main entry
 *  @details	x
 *
 *  @section	Purpose
 *      x
 *
 *  @param	[in]	name	descrip
 *
 *  @param	[out]	name	descrip
 *
 *  @return	(type) descrip
 *
 *  @pre	x
 *
 *  @post	x
 *
 *  @section	Operation
 *	x
 *		
 *  @section	Opens
 *     stdComments
 *     printf on activities
 *     activities for all buttons
 *     ...!
 *
 *  @section	Hazards & Risks
 *  	x
 *
 *  @section	Todo
 *	x
 *
 *  @section	Timing
 *  	x
 *
 *  @note     x
 */
/*************************************************************************************************/
int main(void) {

    // Initialize.
    log_init();
    timer_init();
    leds_init();
    buttons_init();
    power_management_init();
    ble_stack_init();
    scan_init();
    gatt_init();
    db_discovery_init();
    lbs_c_init();

    // Start execution.
    NRF_LOG_INFO("Blinky CENTRAL example started.");
    scan_start();

    // Turn on the LED to signal scanning.
    bsp_board_led_on(CENTRAL_SCANNING_LED);

    // Enter main loop.
    for (;;) {
        idle_state_handle();
    }
}
